_org_posts/_posts/2021-12-15-boj-5635.org
#+HTML: ---
#+HTML: title: BOJ 5635 생일
#+HTML: tags: STL
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 5635
- 생일과 이름을 같이 저장, 정렬
- 앞뒤 노드 얻기

** 접근하기
- 구조체를 선언하고 vector에 담기
- STL pair를 이용

** 코드 - 구조체 선언 + vector
#+BEGIN_SRC cpp
#include <iostream>
#include <string>
#include <vector>
#include <algorithm>
using namespace std;

typedef struct Node {
    int cnt;
    string name;
} Node;

bool cmp(const Node& p1, const Node& p2)
{
    return (p1.cnt < p2.cnt);
}

int main(int argc, char* argv[])
{
    int N;
    cin >> N;
    vector<Node> v(N);
    int day, month, year;
    for(int i=0;i<N;i++) {
        cin >> v[i].name >> day >> month >> year;    
        v[i].cnt = (year*365) + (month*30) + day; 
    }
    sort(v.begin(), v.end(), cmp);
    cout << v.back().name << "\n";
    cout << v.front().name << "\n";
    return 0;
}
#+END_SRC

** 코드 - STL pair를 이용
#+BEGIN_SRC cpp
#include <iostream>
#include <string>
#include <vector>
#include <algorithm>
#include <utility>
using namespace std;

int main(int argc, char* argv[])
{
    int N;
    cin >> N;

    vector<pair<int, string>> v(N);
    int day, month, year;
    for(int i=0;i<N;i++) {
        cin >> v[i].second >> day >> month >> year;    
        v[i].first = (year*365) + (month*30) + day; 
    }
    sort(v.begin(), v.end());
    cout << v.back().second << "\n";
    cout << v.front().second << "\n";
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/5635
